//1.编写函数, 输入字符序列, 建立二叉树的二叉链表
//2.编写函数, 实现二叉树的中序递归遍历算法。
//3.编写函数, 实现二叉树的中序非递归遍历算法
//4.编写函数, 借助队列实现二叉树的层次遍历算法
//5.编写函数, 求二叉树的高度
//6.编写函数, 求二叉树的结点个数
//7.编写函数, 求二叉树的叶子个数
//8.编写函数, 交换二叉树每个结点的左子树和右子树
//9.编写一个主函数, 在主函数中设计一个简单的菜单, 分别调试上述算法

//#define _CRT_SECURE_NO_WARNINGS

//void menu()
//{
//	printf("\n*******************************************************************************\n");
//	printf("~~~~~~~~~~~~~~~~~~~~~~~~~~~~二叉树功能主菜单~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n");
//	printf("\t     1.递归法创建二叉链表            2.递归法中序遍历二叉树                    \n");
//	printf("\t     3.递归法前序遍历二叉树          4.递归法后序遍历二叉树                    \n");
//	printf("\t     5.非递归法中序遍历二叉树        6.层次法遍历二叉树                        \n");
//	printf("\t     7.二叉树的高度                  8.二叉树的结点个数                        \n");
//	printf("\t     9.二叉树的叶子结点个数          10.交换二叉树的所有左右子树               \n");
//	printf("\t     0.退出系统                                                                \n");
//	printf("\n*******************************************************************************\n");
//	printf("\t请选择:");
//}

/* 前序遍历二叉树的递归算法 */
//void PreOrder(BiTree *T)
//{
//	if (T)
//	{
//		printf("%c", T->data);
//		PreOrder(T->lchild);
//		PreOrder(T->rchild);
//	}
//}
/* 后序遍历二叉树的递归算法 */
//void PostOrder(BiTree *T)
//{
//	if (T)
//	{
//		PostOrder(T->lchild);
//		PostOrder(T->rchild);
//		printf("%c", T->data);
//	}
//}